/* Задача 64: Задайте значение N. Напишите программу, которая выведет все натуральные
числа в промежутке от N до 1. Выполнить с помощью рекурсии.

N = 5 -> "5, 4, 3, 2, 1"
N = 8 -> "8, 7, 6, 5, 4, 3, 2, 1" 

5
4=5-1 n-1
3 = 4-1
2 = 3-1
1 = 2-1


*/

int Func (int num)
{
    if ()
    int prev = num - 1;
    return prev;
}

Console.WriteLine("Insert nuber");
int N = Int32.Parse(Console.ReadLine());


